/*
HTML5 CSS3
Любое веб приложение состоит из 2 частей frontend(Clientside) и backend(serverside)
На стороне клиента всегда работает браузер а на стороне сервера приложение которое называется web server
Frontend(HTML CSS и JavaScript)
Backend может быть выполнен на разных языках и с применением разных технологий долгое время использовался php а теперь Java/C#(ASP.NET)/Python(Dhango)
Как правило основу любого веб приложения составляет база данных то есть на стороне сервера как правило работает не только веб сервер а ещё  определённая СУБД в зависимости от того какая технология и следовательно какой язык применяется
Какой бы язык технологию или СУБД не использовали на стороне сервера всё что она присылает клиенту преобразуется в HTML разметку
HTML (HyperText Markup Language) - не язык программирования а язык разметки он отвечает исключительно за графическое отображение
Всё что написано на языке HTML обрабатывается и отображается браузером хотя на самом деле браузер обрабатывает и CSS и JavaScript
Ключевым понятием языка HTML является descriptor - элемент языка который описывает определённую часть веб страницы
Дискрипторы бывают:
1)Парные - делятся на 1)Блочные 2)Линейные(строчные) 
2)Не парные
Всегда пишутся в угловых скобках
Дискрипторы можно вкладывать один в другой 
Блочный дискриптор никогда и ни при каких обстоятельсвах нельзя вкладывать в линейный это грубейшее нарушение правил разметки
Линейные дискрипторы можно писать только внутри блочных 
Блочные дискрипторы также могут вкладываться в другие блочные дискипторы но это делается в редких случаях и с очень большой осторожностью
Строчные(линейные) дискрипторы бывают физического форматирования и логического форматирования
У многих дискрипторов также есть атрибуты которые уточняют или модифицируют действия дискрипторов
У каждого атрибуте есть имя и значение




















*/